# Pandas

Es una libreria que permite manipulacion de datos y tablas de datos dentro de `Python`

cargada normalmente como:

In [1]:
import pandas as pd

Ejemplo de datos lista de listas

In [2]:
data = [[1, 100, 'a'], [2, 200, 'b'], [3, 300, 'c'], [4, 400, 'd']]

Conversion a dataframe tipo de datos `pd.DataFrame`

In [3]:
df = pd.DataFrame(data)
df

   0    1  2
0  1  100  a
1  2  200  b
2  3  300  c
3  4  400  d

metodos de descripcion de los datos

In [4]:
print("type(df)=", type(df))
print("\ndf.shape=", df.shape)
print("\ndf.shape=", dict(df.dtypes))
print("")
df.info()

type(df)= <class 'pandas.core.frame.DataFrame'>

df.shape= (4, 3)

df.shape= {0: dtype('int64'), 1: dtype('int64'), 2: dtype('O')}

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      int64
 1   1       4 non-null      int64
 2   2       4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

Concatenar DataFrames con metodo `pd.concat`

In [5]:
df = pd.concat([df,df],axis=0)
df

   0    1  2
0  1  100  a
1  2  200  b
2  3  300  c
3  4  400  d
0  1  100  a
1  2  200  b
2  3  300  c
3  4  400  d

## Indices

https://pandas.pydata.org/docs/reference/api/pandas.Index.html

Indice de la tabla y asignacion de una lista/columna

In [6]:
idx = df[0] * df[1] + df.reset_index().index
df.index = idx
df

      0    1  2
100   1  100  a
401   2  200  b
902   3  300  c
1603  4  400  d
104   1  100  a
405   2  200  b
906   3  300  c
1607  4  400  d

## Columnas

In [7]:
df.columns = ['col_1','col_2','col_3']
df

      col_1  col_2 col_3
100       1    100     a
401       2    200     b
902       3    300     c
1603      4    400     d
104       1    100     a
405       2    200     b
906       3    300     c
1607      4    400     d

## Filtros / Slices

In [8]:
filtro = df['col_1']>=3
df[filtro]

      col_1  col_2 col_3
902       3    300     c
1603      4    400     d
906       3    300     c
1607      4    400     d

filtro directo

In [9]:
df[df['col_1']>=3]

      col_1  col_2 col_3
902       3    300     c
1603      4    400     d
906       3    300     c
1607      4    400     d

## Creacion de campos

https://pbpython.com/groupby-agg.html

In [10]:
df['col_4'] = df['col_2']**df['col_1']
df

      col_1  col_2 col_3        col_4
100       1    100     a          100
401       2    200     b        40000
902       3    300     c     27000000
1603      4    400     d  25600000000
104       1    100     a          100
405       2    200     b        40000
906       3    300     c     27000000
1607      4    400     d  25600000000

creacion de campos on-the-fly

In [11]:
df.assign(col_5=lambda x: x["col_4"]/x["col_2"]**2)

      col_1  col_2 col_3        col_4      col_5
100       1    100     a          100       0.01
401       2    200     b        40000       1.00
902       3    300     c     27000000     300.00
1603      4    400     d  25600000000  160000.00
104       1    100     a          100       0.01
405       2    200     b        40000       1.00
906       3    300     c     27000000     300.00
1607      4    400     d  25600000000  160000.00

si no se asigna no crea la nueva columna en el `df`

In [12]:
print("columnas= ",list(df.columns))

columnas=  ['col_1', 'col_2', 'col_3', 'col_4']

In [13]:
df = df.assign(col_5=lambda x: x["col_4"]/x["col_2"]**2)
df

      col_1  col_2 col_3        col_4      col_5
100       1    100     a          100       0.01
401       2    200     b        40000       1.00
902       3    300     c     27000000     300.00
1603      4    400     d  25600000000  160000.00
104       1    100     a          100       0.01
405       2    200     b        40000       1.00
906       3    300     c     27000000     300.00
1607      4    400     d  25600000000  160000.00

# EDA

### df.`describe()`

In [14]:
df.describe()

          col_1       col_2         col_4          col_5
count  8.000000    8.000000  8.000000e+00       8.000000
mean   2.500000  250.000000  6.406760e+09   40075.252500
std    1.195229  119.522861  1.184633e+10   74019.276542
min    1.000000  100.000000  1.000000e+02       0.010000
25%    1.750000  175.000000  3.002500e+04       0.752500
50%    2.500000  250.000000  1.352000e+07     150.500000
75%    3.250000  325.000000  6.420250e+09   40225.000000
max    4.000000  400.000000  2.560000e+10  160000.000000

In [15]:
df.describe(include='all')

           col_1       col_2 col_3         col_4          col_5
count   8.000000    8.000000     8  8.000000e+00       8.000000
unique       NaN         NaN     4           NaN            NaN
top          NaN         NaN     a           NaN            NaN
freq         NaN         NaN     2           NaN            NaN
mean    2.500000  250.000000   NaN  6.406760e+09   40075.252500
std     1.195229  119.522861   NaN  1.184633e+10   74019.276542
min     1.000000  100.000000   NaN  1.000000e+02       0.010000
25%     1.750000  175.000000   NaN  3.002500e+04       0.752500
50%     2.500000  250.000000   NaN  1.352000e+07     150.500000
75%     3.250000  325.000000   NaN  6.420250e+09   40225.000000
max     4.000000  400.000000   NaN  2.560000e+10  160000.000000

In [16]:
## describe dosen't include SUM, so...
df.describe().T.assign(sum=df[list(df.describe().columns)].sum())

,count,mean,std,min,25%,50%,75%,max,sum
col_1,8.0,2.500000e+00,1.195229e+00,1.00,1.7500,2.5,3.250000e+00,4.000000e+00,2.000000e+01
col_2,8.0,2.500000e+02,1.195229e+02,100.00,175.0000,250.0,3.250000e+02,4.000000e+02,2.000000e+03
col_4,8.0,6.406760e+09,1.184633e+10,100.00,30025.0000,13520000.0,6.420250e+09,2.560000e+10,5.125408e+10
col_5,8.0,4.007525e+04,7.401928e+04,0.01,0.7525,150.5,4.022500e+04,1.600000e+05,3.206020e+05